Revit 2026 API

# PolymeshFacetGetVertices Method

---

Returns the three vertices that define this facet

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<int> GetVertices()
```
```vb
Public Function GetVertices As IList(Of Integer)
```
```cpp
public:
IList<int>^ GetVertices()
```
```fsharp
member GetVertices : unit -> IList<int>
```

#### Return Value

IListInt32

A container with three integers (indices of the vertices) is returned.

#### Reference

PolymeshFacet Class

Autodesk.Revit.DB Namespace